Enums/СтатусыЗаявокНаОбеспечение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявокНаОбеспечение</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаВыполнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыЗаявокНаОбеспечение/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Не Параметры.Отбор.Свойство("Автор") // Список ограничивается только при редактировании документа.
		Или ПраваПользователяПовтИсп.СогласованиеЗаявокНаОбеспечение() // Согласующий может выполнить любые действия над документом
		Тогда
		Возврат;
	КонецЕсли;
		
	СтандартнаяОбработка = Ложь;
	ИсключаемыеЗначения = Новый Массив;
	ИсключаемыеЗначения.Добавить(НаВыполнении); // Запрет согласования.
	
	Если Параметры.Отбор.Автор <> Пользователи.ТекущийПользователь() Тогда
		// Запрет закрытия.
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ИсключаемыеЗначения, КонечныеСтатусы());
	КонецЕсли;
	
	ОбщегоНазначенияУТ.ДоступныеДляВыбораЗначенияПеречисления(
		ПустаяСсылка().Метаданные().Имя,
		ДанныеВыбора,
		Параметры,
		ИсключаемыеЗначения);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ДоступныеМаршруты

Процедура ЗаполнитьДоступныеМаршрутыСтатусов(Форма) Экспорт

	ДоступноСогласование = ПраваПользователяПовтИсп.СогласованиеЗаявокНаОбеспечение();
	ДоступноЗакрытие = ДоступноСогласование Или Форма.Объект.Автор = Пользователи.ТекущийПользователь();

	#Область Черновик
	
	РаботаСПротоколомДокумента.ДобавитьДоступныйМаршрут(
		Форма,
		Черновик,
		НаСогласовании,
		НСтр("ru = 'Отправить на согласование'"),
		"Ответственный");

	ДобавитьОтмену(Форма, Черновик, ДоступноЗакрытие);

#КонецОбласти

#Область НаСогласовании
	
	Если ДоступноСогласование Тогда
		РаботаСПротоколомДокумента.ДобавитьДоступныйМаршрут(
			Форма,
			НаСогласовании,
			НаВыполнении,
			НСтр("ru = 'Передать на выполнение'"));
			
	КонецЕсли;
	
	РаботаСПротоколомДокумента.ДобавитьМаршрутПеренаправления(Форма, НаСогласовании);
	ДобавитьОтмену(Форма, НаСогласовании, ДоступноЗакрытие);

#КонецОбласти

#Область НаВыполнении
	
	Если ДоступноЗакрытие Тогда
		
		РаботаСПротоколомДокумента.ДобавитьДоступныйМаршрут(
			Форма,
			НаВыполнении,
			Выполнена,
			НСтр("ru = 'Отметить выполнение'"));
			
	КонецЕсли;
	
	РаботаСПротоколомДокумента.ДобавитьМаршрутПеренаправления(Форма, НаВыполнении);
	
	РаботаСПротоколомДокумента.ДобавитьДоступныйМаршрут(
		Форма,
		НаВыполнении,
		НаСогласовании,
		НСтр("ru = 'Вернуть на согласование'"),
		"Ответственный");
		
	ДобавитьОтмену(Форма, НаВыполнении, ДоступноЗакрытие);

#КонецОбласти

#Область Отменена
	
	РаботаСПротоколомДокумента .ДобавитьДоступныйМаршрут(
		Форма,
		Отменена,
		Черновик,
		НСтр("ru = 'Вернуть в ""Черновик""'"),
		"Автор");

#КонецОбласти

#Область Выполнена

	Если ДоступноСогласование Тогда
		РаботаСПротоколомДокумента.ДобавитьДоступныйМаршрут(Форма, Выполнена, НаВыполнении, НСтр("ru = 'Вернуть в работу'"));
	Иначе
		РаботаСПротоколомДокумента.ДобавитьДоступныйМаршрут(Форма, Выполнена, Черновик, НСтр("ru = 'Вернуть в черновик'"));
	КонецЕсли;
	
	ДобавитьОтмену(Форма, Выполнена, ДоступноЗакрытие);
	
#КонецОбласти

КонецПроцедуры

Процедура ДобавитьОтмену(ДоступныеМаршруты, ИсходныйСтатус, ДоступноЗакрытие)
	
	Если Не ДоступноЗакрытие Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСПротоколомДокумента.ДобавитьДоступныйМаршрут(ДоступныеМаршруты, ИсходныйСтатус, Отменена, НСтр("ru = 'Отменить заявку'"));
	
КонецПроцедуры

#КонецОбласти

#Область КонечныеСтатусы

// Это конечный статус.
// 
// Параметры:
//  Статус - ПеречислениеСсылка.СтатусыЗаявокНаОбеспечение- проверяемый статус.
// 
// Возвращаемое значение:
//  Булево - Это конечный статус работы над документом
Функция ЭтоКонечныйСтатус(Статус) Экспорт

	Возврат КонечныеСтатусы().Найти(Статус) <> Неопределено;

КонецФункции

// Конечные статусы работы с документом.
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.СтатусыЗаявокНаОбеспечение.
Функция КонечныеСтатусы() Экспорт
	
	КонечныеСтатусы = Новый Массив;
	
	КонечныеСтатусы.Добавить(Выполнена);
	КонечныеСтатусы.Добавить(Отменена);
	
	Возврат КонечныеСтатусы;
	
КонецФункции

#КонецОбласти

// Статус требует проведения документа.
// 
// Параметры:
//  Статус - ПеречислениеСсылка.СтатусыЗаявокНаОбеспечение - Проверяемый статус.
// 
// Возвращаемое значение:
//  Булево
Функция Проводить(Статус) Экспорт
	
	СтатусыПроведения = Новый Массив;
	
	СтатусыПроведения.Добавить(НаСогласовании);
	СтатусыПроведения.Добавить(НаВыполнении);
	СтатусыПроведения.Добавить(Выполнена);
	
	Возврат СтатусыПроведения.Найти(Статус) <> Неопределено;
	
КонецФункции

// Это статус прошедший согласование
// 
// Параметры:
//  Статус - ПеречислениеСсылка.СтатусыЗаявокНаОбеспечение - Проверяемый статус.
// 
// Возвращаемое значение:
//  Булево
Функция Согласована(Статус) Экспорт
		
	Возврат СтатусыПрошедшиеСогласование().Найти(Статус) <> Неопределено 
	
КонецФункции

// Статусы прошедшие согласование.
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.СтатусыЗаявокНаОбеспечение - статусы прошедшие согласование
Функция СтатусыПрошедшиеСогласование() Экспорт
	
	СтатусыПрошедшиеСогласование = Новый Массив;
	
	СтатусыПрошедшиеСогласование.Добавить(НаВыполнении);
	СтатусыПрошедшиеСогласование.Добавить(Выполнена);
	
	Возврат СтатусыПрошедшиеСогласование;
	
КонецФункции

#КонецОбласти

#КонецЕсли
